# ----------------------------------------------------------------- #
# 01. Pré-modelagem -----
# ----------------------------------------------------------------- #

## Dados de ocorrência -----

## Dados ambientais -----

# ----------------------------------------------------------------- #
# 02. Modelagem -----
# ----------------------------------------------------------------- #

## Criar instruções para o modelo -----

## Treinar um modelo "single algorithm" -----

## Treinar um modelo "multi algorithm" -----

# ----------------------------------------------------------------- #
# 03. Pós-modelagem -----
# ----------------------------------------------------------------- #

## Avaliar a performance do modelo -----

## Avaliar a contribuição das variáveis -----

## Criar projeções -----

## Criar ensemble -----

# ----------------------------------------------------------------- #
# 04. Plotar mapas -----
# ----------------------------------------------------------------- #

## Mapa de adequabilidade ambiental -----

## Mapa binário -----